// SPDX-License-Identifier: MIT

/* automatically generated by rust-bindgen 0.72.1 */

pub type __uint8_t = ::core::ffi::c_uchar;
pub type __sa_family_t = __uint8_t;
pub type sa_family_t = __sa_family_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_nl {
    pub nl_len: u8,
    pub nl_family: sa_family_t,
    pub nl_pad: u16,
    pub nl_pid: u32,
    pub nl_groups: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr_nl"][::core::mem::size_of::<sockaddr_nl>() - 12usize];
    ["Alignment of sockaddr_nl"]
        [::core::mem::align_of::<sockaddr_nl>() - 4usize];
    ["Offset of field: sockaddr_nl::nl_len"]
        [::core::mem::offset_of!(sockaddr_nl, nl_len) - 0usize];
    ["Offset of field: sockaddr_nl::nl_family"]
        [::core::mem::offset_of!(sockaddr_nl, nl_family) - 1usize];
    ["Offset of field: sockaddr_nl::nl_pad"]
        [::core::mem::offset_of!(sockaddr_nl, nl_pad) - 2usize];
    ["Offset of field: sockaddr_nl::nl_pid"]
        [::core::mem::offset_of!(sockaddr_nl, nl_pid) - 4usize];
    ["Offset of field: sockaddr_nl::nl_groups"]
        [::core::mem::offset_of!(sockaddr_nl, nl_groups) - 8usize];
};
